/*
====================================================================================================================================================================================
														Histórico de alterações
====================================================================================================================================================================================
Data		Por							Descrição
**********	********************		********************************************************************************************************************************************
05/02/2024	ANDERSON WILLIAM			- Criação da consulta para o ReportServer via stored procedure, para facilitar a manutenção e implantação nos BD das empresas
										- Consulta é usada como DATASET compartilhada no ReportServer
							
************************************************************************************************************************************************************************************
*/
create proc [dbo].[usp_RS_Estoques]
as 
begin
	SELECT 
	LESCOD AS LESCOD, 
	RTRIM(LTRIM(STR(LESCOD))) + ' - ' + RTRIM(LTRIM(LESDES)) AS LESDES  

	FROM TBS034 (nolock) 
	ORDER BY LESCOD
End
